c1 = int (input('Введите число: '))
c2 = int (input('А теперь следующее число: '))

o = int (input('Что нужно сделать?'
               '\n 1 = Сложение'
               '\n 2 = Вычитание'
               '\n 3 = Деление'
               '\n 4 = Умножение'
               '\n'))

if o == 1:
    r = c1 + c2
    p = 'сложение'
    t = p
if o == 2:
    r = c1 - c2
    l = 'вычитание'
    t = l
if o == 3:
    r = float(c1 / c2)
    m = 'деление'
    t = m
if o == 4:
    r = c1 * c2
    n = 'умножение'
    t = n
print ('Результат ',t,' = ',r)
